&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьДлительности();
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар;
		Объект.СчетБухгалтерскогоУчета = ПланыСчетов.Хозрасчетный.Товары;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДлительности()
	Элементы.ДлительностьУслуги.Видимость = (Объект.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.СчетБухгалтерскогоУчета.Видимость = (Объект.ТипНоменклатуры <> ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МатериалКлиента"));
КонецПроцедуры

&НаКлиенте
Процедура ТипНоменклатурыПриИзменении(Элемент)
	
	УстановитьВидимостьДлительностиНаСервере();
	
	Если Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Материал") Тогда
		Объект.СчетБухгалтерскогоУчета = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Материалы");
		Элементы.СчетБухгалтерскогоУчета.Видимость = Истина;
		
	ИначеЕсли Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар") Тогда
		Объект.СчетБухгалтерскогоУчета = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Товары");
		Элементы.СчетБухгалтерскогоУчета.Видимость = Истина;
		
	ИначеЕсли Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") Тогда
		Объект.СчетБухгалтерскогоУчета = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.РасходыНаПродажу");
		Элементы.СчетБухгалтерскогоУчета.Видимость = Истина;
		
	ИначеЕсли Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МатериалКлиента") Тогда
		Объект.СчетБухгалтерскогоУчета = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ПустаяСсылка");
		Элементы.СчетБухгалтерскогоУчета.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура УстановитьВидимостьДлительностиНаСервере()
	УстановитьВидимостьДлительности();
КонецПроцедуры

&НаКлиенте
Процедура СчетБухгалтерскогоУчетаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	СписокСчетов = Новый СписокЗначений;
	
	Если Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Материал") Тогда
		СписокСчетов.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Материалы"));
		
	ИначеЕсли Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар") Тогда
		СписокСчетов.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Товары"));
		
	ИначеЕсли Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") Тогда
		СписокСчетов.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.РасходыНаПродажу"));
		СписокСчетов.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ПрочиеДоходыИРасходы"));
	КонецЕсли;
	
	ДанныеВыбора = СписокСчетов;
	
КонецПроцедуры


