Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.УчетнаяПолитика.Записывать = Истина;
	Движение = Движения.УчетнаяПолитика.Добавить();
	Движение.Период = Дата;
	Движение.СпособУчетаЗапасов = СпособСписанияЗапасов;
	
	Если СпособСписанияЗапасов = Перечисления.СпособыСписанияЗапасов.ПоСредней Тогда
		
		Движения.ТоварыНаСкладах.Записывать = Истина;
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрНакопления.ТоварыНаСкладах");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		ЗапросОстатков = Новый Запрос;
		ЗапросОстатков.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Склад КАК Склад,
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладахОстатки.СрокГодности КАК СрокГодности,
		|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ТоварыНаСкладахОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(&Граница, СрокГодности <> ДАТАВРЕМЯ(1, 1, 1)) КАК ТоварыНаСкладахОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Склад,
		|	Номенклатура
		|ИТОГИ
		|	СУММА(КоличествоОстаток),
		|	СУММА(СуммаОстаток)
		|ПО
		|	Склад,
		|	Номенклатура";
		
		ЗапросОстатков.УстановитьПараметр("Граница", Новый Граница(Дата, ВидГраницы.Исключая));
		РезультатОстатков = ЗапросОстатков.Выполнить();
		
		ВыборкаСклад = РезультатОстатков.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСклад.Следующий() Цикл
			
			ВыборкаНоменклатура = ВыборкаСклад.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаНоменклатура.Следующий() Цикл
				
				ВыборкаДетальныеЗаписи = ВыборкаНоменклатура.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					ДвижениеРасход = Движения.ТоварыНаСкладах.Добавить();
					ДвижениеРасход.ВидДвижения = ВидДвиженияНакопления.Расход;
					ДвижениеРасход.Период = Дата;
					ДвижениеРасход.Склад = ВыборкаДетальныеЗаписи.Склад;
					ДвижениеРасход.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
					ДвижениеРасход.СрокГодности = ВыборкаДетальныеЗаписи.СрокГодности;
					ДвижениеРасход.Количество = ВыборкаДетальныеЗаписи.КоличествоОстаток;
					ДвижениеРасход.Сумма = ВыборкаДетальныеЗаписи.СуммаОстаток;
					
				КонецЦикла;
				
				ДвижениеПриход = Движения.ТоварыНаСкладах.Добавить();
				ДвижениеПриход.ВидДвижения = ВидДвиженияНакопления.Приход;
				ДвижениеПриход.Период = Дата;
				ДвижениеПриход.Склад = ВыборкаСклад.Склад;
				ДвижениеПриход.Номенклатура = ВыборкаНоменклатура.Номенклатура;
				ДвижениеПриход.Количество = ВыборкаНоменклатура.КоличествоОстаток;
				ДвижениеПриход.Сумма = ВыборкаНоменклатура.СуммаОстаток;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры



