Функция getUserGET(Запрос)
	
	Логин = Строка(Запрос.ПараметрыЗапроса.Получить("username"));
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	
	Если СокрЛП(Логин) = "" Тогда
		Ответ.КодСостояния = 400;
		Возврат Ответ;
	КонецЕсли;
	
	СтруктураДанных = Новый Структура;
	
	ЗапросПользователи = Новый Запрос;
	ЗапросПользователи.Текст = 
	"ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Пользователи.Ссылка) КАК Ссылка,
	|	Пользователи.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	НЕ Пользователи.ПометкаУдаления
	|	И Пользователи.Наименование = &Наименование";
	
	ЗапросПользователи.УстановитьПараметр("Наименование", Логин);
	РезультатЗапроса = ЗапросПользователи.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		СтруктураДанных.Вставить("code", Строка(Выборка.Ссылка));
		СтруктураДанных.Вставить("name", Выборка.Наименование);
	Иначе
		Ответ.КодСостояния = 404;
		Возврат Ответ;
	КонецЕсли;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураДанных);
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
	Возврат Ответ;
	
КонецФункции

Функция registerGET(Запрос)
	
	Логин = Запрос.ПараметрыЗапроса.Получить("username");
	Телефон = Запрос.ПараметрыЗапроса.Получить("phone");
	
	НовыйУЗ = ПользователиИнформационнойБазы.СоздатьПользователя();
	НовыйУЗ.Имя = Логин;
	НовыйУЗ.Роли.Добавить(Метаданные.Роли.ПолныеПрава); 
	НовыйУЗ.Записать();
	
	Контрагент = Справочники.Контрагенты.СоздатьЭлемент();
	Контрагент.Наименование = Логин;
	
	Контрагент.КонтактныйТелефон = Телефон; 
	
	Контрагент.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Покупатель;
	Контрагент.Комментарий = "Контрагент зарегистрирован через мобильное приложение.";
	Контрагент.Записать();
	
	Пользователь = Справочники.Пользователи.СоздатьЭлемент();
	Пользователь.Наименование = Логин;
	Пользователь.Код = Строка(НовыйУЗ.УникальныйИдентификатор);
	
	Пользователь.Контрагент = Контрагент.Ссылка;
	Пользователь.Записать();
	
	Данные = Новый Структура("code, name", Пользователь.Код, Логин);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Данные);
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(ЗаписьJSON.Закрыть());
	
	Возврат Ответ;
	
КонецФункции

Функция customerOrdersPOST(Запрос)
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Запрос.ПолучитьТелоКакСтроку());
	ДанныеЗапроса = ПрочитатьJSON(ЧтениеJSON, Ложь);
	ЧтениеJSON.Закрыть();
	
	НовыйЗаказ = Документы.ЗаказНаряд.СоздатьДокумент();
	
	НовыйЗаказ.Дата = ТекущаяДата();
	
	НовыйЗаказ.ДатаЗаписи = ПрочитатьДатуJSON(ДанныеЗапроса["ДатаЗаписи"], ФорматДатыJSON.ISO);
	НовыйЗаказ.Сотрудник  = Справочники.Сотрудники.НайтиПоНаименованию(ДанныеЗапроса["Сотрудник"]);
	
	ПользовательОсновы = Справочники.Пользователи.НайтиПоКоду(ДанныеЗапроса["GUIDПользователя"]);
	НовыйЗаказ.Клиент = ПользовательОсновы.Контрагент; 
	
	Для Каждого СтруктураУслуги Из ДанныеЗапроса["МассивУслуг"] Цикл
		
		НоваяСтрока = НовыйЗаказ.Услуги.Добавить();
		НоваяСтрока.Услуга = Справочники.Номенклатура.НайтиПоНаименованию(СтруктураУслуги["Услуга"]);
		НоваяСтрока.Цена   = Число(СтруктураУслуги["Стоимость"]);
		НоваяСтрока.Количество = Число(СтруктураУслуги["Количество"]);
		НоваяСтрока.Сумма  = НоваяСтрока.Цена * НоваяСтрока.Количество;
		
	КонецЦикла;
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	Попытка
		НовыйЗаказ.Записать(РежимЗаписиДокумента.Проведение);
		ТекстОтвета = "Заказ-наряд успешно проведен. Номер: " + НовыйЗаказ.Номер;
	Исключение
		Ответ.КодСостояния = 500;
		ТекстОтвета = "Ошибка проведения Заказ-наряда на сервере!";
	КонецПопытки;
	
	Ответ.УстановитьТелоИзСтроки(ТекстОтвета, "UTF-8");
	Возврат Ответ;
	
КонецФункции