Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Родитель) Тогда
		Если Родитель = Справочники.Номенклатура.Товары Тогда
			Если ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Товар Тогда
				Отказ = Истина;
			КонецЕсли;
		ИначеЕсли Родитель = Справочники.Номенклатура.Услуги Тогда
			Если ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Услуга Тогда
				Отказ = Истина;
			КонецЕсли;
		ИначеЕсли Родитель = Справочники.Номенклатура.МатериалыСобственные Тогда
			Если ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Материал Тогда
				Отказ = Истина;
			КонецЕсли;
		ИначеЕсли Родитель = Справочники.Номенклатура.МатериалыКлиента Тогда
			Если ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.МатериалКлиента Тогда
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Отказ Тогда
		Сообщить("Выбранный тип номенклатуры не соответствует текущей группе!");
		Возврат;
	КонецЕсли;
	
	Если ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Материал Тогда
		Если СчетБухгалтерскогоУчета <> ПланыСчетов.Хозрасчетный.Материалы Тогда
			Отказ = Истина;
		КонецЕсли;
		
	ИначеЕсли ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар Тогда
		Если СчетБухгалтерскогоУчета <> ПланыСчетов.Хозрасчетный.Товары Тогда
			Отказ = Истина;
		КонецЕсли;
		
	ИначеЕсли ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
		Если СчетБухгалтерскогоУчета <> ПланыСчетов.Хозрасчетный.РасходыНаПродажу
			И СчетБухгалтерскогоУчета <> ПланыСчетов.Хозрасчетный.ПрочиеДоходыИРасходы Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Отказ Тогда
		Сообщить("Счет бухгалтерского учета не соответствует типу номенклатуры!");
	КонецЕсли;

КонецПроцедуры
