Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли; 
	
	СуммаДокумента = Услуги.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ЗаказыКлиентов.Записывать = Истина;

	Движение = Движения.ЗаказыКлиентов.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Клиент = Клиент;
	Движение.ЗаказКлиента = Ссылка;
	Движение.Сумма = Услуги.Итог("Сумма");

	Движения.МатериалыЗаказчиков.Записывать = Истина;

	ЗапросМатериалы = Новый Запрос;
	ЗапросМатериалы.Текст = 
	"ВЫБРАТЬ
	|	Материалы.Номенклатура КАК Номенклатура,
	|	СУММА(Материалы.Количество) КАК Количество
	|ИЗ
	|	Документ.ЗаказНаряд.МатериалыЗаказчика КАК Материалы
	|ГДЕ
	|	Материалы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Материалы.Номенклатура";

	ЗапросМатериалы.УстановитьПараметр("Ссылка", Ссылка);

	ВыборкаМатериалы = ЗапросМатериалы.Выполнить().Выбрать();

	Пока ВыборкаМатериалы.Следующий() Цикл

		ДвижениеМат = Движения.МатериалыЗаказчиков.Добавить();
		ДвижениеМат.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеМат.Период = Дата;
		ДвижениеМат.Номенклатура = ВыборкаМатериалы.Номенклатура;
		ДвижениеМат.Заказчик = Клиент;
		ДвижениеМат.Склад = Склад;
		ДвижениеМат.Количество = ВыборкаМатериалы.Количество;

	КонецЦикла;

КонецПроцедуры

