&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьИТипыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УстановитьВидимостьИТипыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПлательщикПриИзменении(Элемент)
	
	УстановитьВидимостьИТипыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьИТипыНаСервере()
	
	ТекущийВидОперации = Объект.ВидОперации;
	ВидимостьДоговора  = Истина;
	
	Если ТекущийВидОперации = Перечисления.ВидыОперацийПоступленияДенег.ВозвратОтПодотчетника Тогда
		
		ВидимостьДоговора = Ложь;
		
		Элементы.Плательщик.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Сотрудники");
		
	ИначеЕсли ТекущийВидОперации = Перечисления.ВидыОперацийПоступленияДенег.ОплатаОтПокупателя Тогда
		
		Элементы.Плательщик.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
		
	ИначеЕсли ТекущийВидОперации = Перечисления.ВидыОперацийПоступленияДенег.ВозвратОтПоставщика Тогда
		
		Элементы.Плательщик.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Плательщик) Тогда
		
		Если ТипЗнч(Объект.Плательщик) = Тип("СправочникСсылка.Контрагенты") Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Контрагенты.ТипКонтрагента КАК ТипКонтрагента
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	Контрагенты.Ссылка = &Плательщик";
			
			Запрос.УстановитьПараметр("Плательщик", Объект.Плательщик);
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				Если Выборка.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Покупатель Тогда
					
					ВидимостьДоговора = Ложь;
					
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.Договор.Видимость = ВидимостьДоговора;
	
КонецПроцедуры
