Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
	
	Если ИменаПараметровСеанса = Неопределено Тогда
		
	Иначе
		
		УстановленныеПараметры = Новый Массив;
		
		Для Каждого ИмяПараметра Из ИменаПараметровСеанса Цикл
			
			УстановитьЗначениеПараметраСеанса(ИмяПараметра, УстановленныеПараметры);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьЗначениеПараметраСеанса(Знач ИмяПараметра, УстановленныеПараметры)
	
	Если УстановленныеПараметры.Найти(ИмяПараметра) <> Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ИмяПараметра = "ТекущийПользователь" Тогда
		
		ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
		
		Если ТекущийПользователь = Неопределено Тогда
			
			Возврат;
			
		КонецЕсли;
		
		ПользовательСсылка = Справочники.Пользователи.НайтиПоКоду(ТекущийПользователь.УникальныйИдентификатор);
		
		Если ПользовательСсылка.Пустая() Тогда
			
			ПользовательОбъект = Справочники.Пользователи.СоздатьЭлемент();
			ПользовательОбъект.Код = ТекущийПользователь.УникальныйИдентификатор;
			ПользовательОбъект.Наименование = ТекущийПользователь.Имя;
			ПользовательОбъект.Записать();
			
			ПользовательСсылка = ПользовательОбъект.Ссылка;
			
		КонецЕсли;
		
		ПараметрыСеанса.ТекущийПользователь = ПользовательСсылка;
		
		УстановленныеПараметры.Добавить(ИмяПараметра);
		
	КонецЕсли;
	
КонецПроцедуры
