&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	ОбновитьИнтерфейсНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	
	ОбновитьИнтерфейсНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьИнтерфейсНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнтерфейсНаСервере()
	
	ТекущийВидОперации = Объект.ВидОперации;
	ВидыОперацийРасхода = Перечисления.ВидыОперацийРасходаДенег;
	ВидимостьДоговора = Истина;
	
	Если ТекущийВидОперации = ВидыОперацийРасхода.ВыдачаПодотчетнику Тогда
		
		Элементы.Получатель.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Сотрудники");
		ВидимостьДоговора = Ложь;
		
	ИначеЕсли ТекущийВидОперации = ВидыОперацийРасхода.ВыдачаЗаработнойПлаты Тогда
		
		Элементы.Получатель.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Сотрудники");
		ВидимостьДоговора = Ложь;
		
	Иначе
		
		Элементы.Получатель.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
		
	КонецЕсли;
	
	Если ВидимостьДоговора И ЗначениеЗаполнено(Объект.Получатель) Тогда
		
		Если ТипЗнч(Объект.Получатель) = Тип("СправочникСсылка.Контрагенты") Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Контрагенты.ТипКонтрагента КАК ТипКонтрагента
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	Контрагенты.Ссылка = &Получатель";
			
			Запрос.УстановитьПараметр("Получатель", Объект.Получатель);
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				Если Выборка.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Покупатель Тогда
					
					ВидимостьДоговора = Ложь;
					
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.Договор.Видимость = ВидимостьДоговора;
	
КонецПроцедуры
