Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ТипДанных = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанных = Тип("ДокументСсылка.Реализация") Тогда
		
		ДокументОснование = ДанныеЗаполнения;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		Плательщик = ДанныеЗаполнения.Контрагент;
		ВидОперации = Перечисления.ВидыОперацийПоступленияДенег.ОплатаОтПокупателя;
		
	ИначеЕсли ТипДанных = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") Тогда
		
		ДокументОснование = ДанныеЗаполнения;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		Плательщик = ДанныеЗаполнения.Контрагент;
		Договор = ДанныеЗаполнения.Договор;
		ВидОперации = Перечисления.ВидыОперацийПоступленияДенег.ВозвратОтПоставщика;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Хозрасчетный.Записывать = Истина;
	Движения.ДенежныеСредства.Записывать = Истина;
	Движения.ДенежныеСредства.Записать();
	Движения.Хозрасчетный.Записать();
	
	ДвижениеДенСредства = Движения.ДенежныеСредства.Добавить();
	ДвижениеДенСредства.ВидДвижения = ВидДвиженияНакопления.Приход;
	ДвижениеДенСредства.Период = Дата;
	ДвижениеДенСредства.Касса = Касса;
	ДвижениеДенСредства.Сумма = СуммаДокумента;
	
	
	
	Если СуммаДокумента > 0 Тогда
		
		АналитикаПроводки = ПолучитьАналитикуПроводки();
		
		ДвижениеБухгалтерия = Движения.Хозрасчетный.Добавить();
		ДвижениеБухгалтерия.Период = Дата;
		ДвижениеБухгалтерия.Сумма = СуммаДокумента;
		
		ДвижениеБухгалтерия.СчетДт = АналитикаПроводки.СчетДебета;
		ДвижениеБухгалтерия.СчетКт = АналитикаПроводки.СчетКредита;
		ДвижениеБухгалтерия.Содержание = АналитикаПроводки.СодержаниеОперации;
		
		БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(ДвижениеБухгалтерия.СчетДт, ДвижениеБухгалтерия.СубконтоДт, АналитикаПроводки.СубконтоДебет);
		БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(ДвижениеБухгалтерия.СчетКт, ДвижениеБухгалтерия.СубконтоКт, АналитикаПроводки.СубконтоКредит);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьАналитикуПроводки()
	
	СтруктураАналитики = Новый Структура;
	
	СтруктураАналитики.Вставить("СчетДебета", ПланыСчетов.Хозрасчетный.Касса);
	СтруктураАналитики.Вставить("СубконтоДебет", Касса);
	
	Если ВидОперации = Перечисления.ВидыОперацийПоступленияДенег.ОплатаОтПокупателя Тогда
		
		СтруктураАналитики.Вставить("СчетКредита", ПланыСчетов.Хозрасчетный.РасчетыСПокупателями);
		СтруктураАналитики.Вставить("СубконтоКредит", Плательщик);
		СтруктураАналитики.Вставить("СодержаниеОперации", "Оплата от покупателя наличными в кассу");
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступленияДенег.ВозвратОтПоставщика Тогда
		
		СтруктураАналитики.Вставить("СчетКредита", ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками);
		СтруктураАналитики.Вставить("СубконтоКредит", Плательщик);
		СтруктураАналитики.Вставить("СодержаниеОперации", "Возврат от поставщика наличными в кассу");
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступленияДенег.ВозвратОтПодотчетника Тогда
		
		СтруктураАналитики.Вставить("СчетКредита", ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами);
		СтруктураАналитики.Вставить("СубконтоКредит", Плательщик);
		СтруктураАналитики.Вставить("СодержаниеОперации", "Возврат подотчетных средств");
		
	КонецЕсли;
	
	Возврат СтруктураАналитики;
	
КонецФункции

