Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Начисления.Записывать = Истина;
	Движения.УчетЗатрат.Записывать = Истина;
	Движения.Хозрасчетный.Записывать = Истина;
	
	ЗапросОклад = Новый Запрос;
	ЗапросОклад.Текст = 
	"ВЫБРАТЬ
	|	КадроваяИсторияСотрудниковСрезПоследних.Оклад КАК Оклад
	|ИЗ
	|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(&Период, Сотрудник = &Сотрудник) КАК КадроваяИсторияСотрудниковСрезПоследних";
	
	ЗапросОклад.УстановитьПараметр("Период", ДатаОкончания);
	ЗапросОклад.УстановитьПараметр("Сотрудник", Сотрудник);
	
	ВыборкаОклад = ЗапросОклад.Выполнить().Выбрать();
	
	Если ВыборкаОклад.Следующий() Тогда
		ПараметрРасчета = ВыборкаОклад.Оклад;
	Иначе
		ПараметрРасчета = 0;
	КонецЕсли;
	
	МесяцНачисления = НачалоМесяца(ДатаНачала);
	МесяцОкончания = НачалоМесяца(ДатаОкончания);
	
	Пока МесяцНачисления <= МесяцОкончания Цикл
		
		Движение = Движения.Начисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.Начисления.Больничный;
		
		Движение.ПериодДействияНачало = Макс(ДатаНачала, МесяцНачисления);
		Движение.ПериодДействияКонец = Мин(ДатаОкончания, КонецМесяца(МесяцНачисления));
		
		Движение.ПериодРегистрации = ПериодНачисления;
		
		Движение.БазовыйПериодНачало = Макс(ДатаНачала, МесяцНачисления);
		Движение.БазовыйПериодКонец = Мин(ДатаОкончания, КонецМесяца(МесяцНачисления));
		
		Движение.Сотрудник = Сотрудник;
		Движение.ПоказательРасчета = ПараметрРасчета;
		
		МесяцНачисления = ДобавитьМесяц(МесяцНачисления, 1);
		
	КонецЦикла;
	
	Движения.Начисления.Записать();
	
	
	Движения.Начисления.РассчитатьСуммуНачислений();
	
	ЗапросСвод = Новый Запрос;
	ЗапросСвод.Текст = 
	"ВЫБРАТЬ
	|	Начисления.Сотрудник КАК Сотрудник,
	|	СУММА(Начисления.Сумма) КАК Сумма,
	|	Начисления.ВидРасчета.СтатьяЗатрат КАК СтатьяЗатрат
	|ИЗ
	|	РегистрРасчета.Начисления КАК Начисления
	|ГДЕ
	|	Начисления.Регистратор = &Регистратор
	|СГРУППИРОВАТЬ ПО
	|	Начисления.Сотрудник,
	|	Начисления.ВидРасчета.СтатьяЗатрат";
	
	ЗапросСвод.УстановитьПараметр("Регистратор", Ссылка);
	
	ВыборкаСвод = ЗапросСвод.Выполнить().Выбрать();
	
	Пока ВыборкаСвод.Следующий() Цикл
		
		ДвижениеЗатрат = Движения.УчетЗатрат.Добавить();
		ДвижениеЗатрат.Период = Дата;
		ДвижениеЗатрат.СтатьяЗатрат = ВыборкаСвод.СтатьяЗатрат;
		ДвижениеЗатрат.Сумма = ВыборкаСвод.Сумма;
		
		ДвижениеХозрасчетный = Движения.Хозрасчетный.Добавить();
		ДвижениеХозрасчетный.Период = Дата;
		ДвижениеХозрасчетный.СчетДт = ПланыСчетов.Хозрасчетный.РасходыНаПродажу;
		ДвижениеХозрасчетный.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
		ДвижениеХозрасчетный.Сумма = ВыборкаСвод.Сумма;
		ДвижениеХозрасчетный.Содержание = "Отражено начисление по больничному листу за счет работодателя";
		
		БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(ДвижениеХозрасчетный.СчетДт, ДвижениеХозрасчетный.СубконтоДт, ВыборкаСвод.СтатьяЗатрат);
		БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(ДвижениеХозрасчетный.СчетКт, ДвижениеХозрасчетный.СубконтоКт, ВыборкаСвод.Сотрудник);
		
		
	КонецЦикла;
	
КонецПроцедуры


