
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьЗаказНаряда)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьЗаказНаряда(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ПечатьЗаказНаряда(ТабДок, ПараметрКоманды)
	Документы.ЗаказНаряд.ПечатьЗаказНаряда(ТабДок, ПараметрКоманды);
КонецПроцедуры
